<template lang="pug">
SectionCmp(classes='ext_package_services', :title='titles.packageService')
  PackageService(
    v-for='(item, index) in items',
    :key='index',
    :title='item.title',
    :price='item.price',
    :count='item.count',
    :list='item.list'
  )
</template>

<script>
import commonMixin from '@mixins/commonMixin';
import SectionCmp from '@cmp/SectionCmp';
import PackageService from '@cmp/PackageService';

export default {
  name: 'ExtPckgServices',
  mixins: [commonMixin],
  components: {
    SectionCmp,
    PackageService,
  },
  data() {
    return {
      items: [
        {
          title: 'ADVA Touch',
          price: 500,
          count: 5,
          list: [
            'Первинна консультація',
            'Проведення переговорів в інтересах клієнта',
            'Надання інформації з реєстру',
            'виконавчих проваджень',
            'Надання інформації з реєстру судових справ',
            'Підготовка документів',
            'Надання інформації з реєстру прав на нерухомість',
            'Базова консультація в сфері отримання ВНЖ / ПМП через інвестиції',
            'Досудова і претензійна робота',
            'Базова консультація з питання відкриття брокерського / інвестиційного рахунку',
          ],
        },
        {
          title: 'ADVA Help',
          price: 1000,
          count: 8,
          list: [
            'Первинна консультація',
            'Письмове юридичний висновок (Legal Opinion)',
            'Підготовка документів',
            'Надання інформації з реєстру',
            'виконавчих проваджень',
            'Надання інформації з реєстру судових справ',
            'Надання інформації з реєстру прав на нерухомість',
            'Базова консультація в сфері отримання ВНЖ / ПМП через інвестиції',
            'Досудова і претензійна робота',
            'Базова консультація з питання відкриття брокерського / інвестиційного рахунку',
          ],
        },
        {
          title: 'ADVA Care',
          price: 1600,
          count: 10,
          list: [
            'Первинна консультація',
            'Усна консультація юриста і аналіз ситуації з вивченням всіх представлених документів',
            'Досудова і претензійна робота',
            'Підготовка документів',
            'Надання інформації з реєстру виконавчих проваджень',
            'Надання інформації з реєстру судових справ',
            'Надання інформації з реєстру прав на нерухомість',
            'Базова консультація в сфері отримання ВНЖ / ПМП через інвестиції',
            'Базова консультація з питання відкриття брокерського / інвестиційного рахунку',
          ],
        },
      ],
    };
  },
};
</script>

<style lang="scss">
@import '@scssCmp/ExtPckgServices';
</style>
